import 'package:flutter_quiz/data/question.dart';

List<Question> getQList() {
  var Q1 = Question();
  Q1.QTitle =
      'حدیث زیر از کیست؟ "بر دوستی که به عهد خود وفا نمی‌کند اعتماد مکن"';
  Q1.QImageName = '1';
  Q1.QCorrectAnswer = 1;
  Q1.QAnswerList = [
    'امام صادق (ع)',
    'امام علی (ع)',
    'پیامبر اکرم (ص)',
    'امام کاظم (ع)'
  ];

  var Q2 = Question();
  Q2.QTitle = 'نتیجه چه کاری خواری در دنیا و عذاب جهنم است؟';
  Q2.QImageName = '2';
  Q2.QAnswerList = ['غیبت ', 'تهمت ', 'دروغگویی', 'سخن چینی'];
  Q2.QCorrectAnswer = 2;

  var Q3 = Question();
  Q3.QTitle = 'برای شناختن درست کسی چه کاری باید انجام داد؟';
  Q3.QImageName = '3';
  Q3.QAnswerList = [
    'به راستگویی و امانتداری او نگاه کنیم',
    'به نماز خواندن و دعا خواندنش توجه کنیم',
    'به رکوع و سجود طولانی‌اش دقت کنیم',
    'به دینداری و تقوای او توجه کنیم '
  ];
  Q3.QCorrectAnswer = 0;

  var Q4 = Question();
  Q4.QTitle =
      'این بیت شعر " دوست آن دانم که گیرد دست دوست / در پریشان حالی و درماندگی " به کدام ویژگی دوست خوب اشاره دارد؟';
  Q4.QImageName = '4';
  Q4.QAnswerList = [
    'اهل نیکی بودن دوست',
    'راستگویی دوست',
    'راست کرداری دوست',
    'امانت داری دوست'
  ];
  Q4.QCorrectAnswer = 0;

  var Q5 = Question();
  Q5.QTitle =
      'طبق فرموده امام صادق (ع) : دوستان خود را در داشتن دو ویژگی بیازمایید که عبارتند از...';
  Q5.QImageName = '5';
  Q5.QAnswerList = [
    'رعایت اوقات نماز _ نیکی به پدر و مادر',
    'نیکی به همنوعان _ انجام واجبات دینی',
    'راستگویی _ وفای به عهد',
    'رعایت اوقات نماز _ نیکی به همنوعان'
  ];
  Q5.QCorrectAnswer = 3;

  var Q6 = Question();
  Q6.QTitle =
      'پیامبر با اینکه رهبر و رئیس جامعه بود ولی وقتی وارد مجلسی می‌شد هر جایی که خالی بود می‌نشست و هرگز برای خود غذای مشخصی تعیین نمی‌کرد . این ویژگی نشانگر کدام ویژگی اخلاقی ایشان است ؟ ';
  Q6.QImageName = '6';
  Q6.QAnswerList = [
    'بزرگواری و محبت ',
    'عزت نفس ',
    'تواضع و فروتنی ',
    'ساده زیستی'
  ];
  Q6.QCorrectAnswer = 3;

  var Q7 = Question();
  Q7.QTitle =
      'عبارت قرآنی " و انک لعلی خلق عظیم " در مورد کدام ویژگی پیامبر (ص) نازل شده است؟';
  Q7.QImageName = '7';
  Q7.QAnswerList = ['تواضع ', 'رفتار نیکو', 'ساده زیستی ', 'بزرگواری و محبت'];
  Q7.QCorrectAnswer = 1;

  var Q8 = Question();
  Q8.QTitle = 'سرآغاز خوشی‌های مومنان چیست ؟';
  Q8.QImageName = '8';
  Q8.QAnswerList = [
    'مرگ',
    'رد شدن از پل صراط ',
    'رفتن به حوض کوثر ',
    'دیدار پیامبر'
  ];
  Q8.QCorrectAnswer = 0;

  var Q9 = Question();
  Q9.QTitle = 'منظور از " طیبین " چه کسانی هستند ؟ ';
  Q9.QImageName = '9';
  Q9.QAnswerList = ['پاکان', 'پاکیزگان ', 'فرشتگان ', 'مردگان'];
  Q9.QCorrectAnswer = 0;

  var Q10 = Question();
  Q10.QTitle = 'کدام گزینه نادرست است ؟';
  Q10.QImageName = '10';
  Q10.QAnswerList = [
    'دنیا فانی و زودگذر است ',
    'قهرمان زندگی دنیا کسی است که به فکر آخرت خویش است',
    'با پول و ثروت می‌شود آخرت خوبی داشته باشیم',
    'همه موارد'
  ];
  Q10.QCorrectAnswer = 2;

  return [Q1, Q2, Q3, Q4, Q5, Q6, Q7, Q8, Q9, Q10];
}
