import 'package:flutter_quiz/data/question.dart';

List<Question> getQList1() {
  var Q1 = Question();
  Q1.QTitle =
      'رانندگان کلیه وسایل نقلیه موظفند از کدام خط عبور راه حرکت نمایند؟';
  Q1.QImageName = 'driving';
  Q1.QCorrectAnswer = 1;
  Q1.QAnswerList = ['خط وسط', 'سمت راست', 'سمت چپ', 'خط زیگزاگ'];

  var Q2 = Question();
  Q2.QTitle = 'تابلوی توقف ممنوع کدام گزینه می باشد؟';
  Q2.QImageName = '2';
  Q2.QAnswerList = ['1', '2', '3', '4'];
  Q2.QCorrectAnswer = 1;

  var Q3 = Question();
  Q3.QTitle = 'این تابلو بیان گر چیست؟';
  Q3.QImageName = '3';
  Q3.QAnswerList = [
    'فقط عبور پیاده',
    'عبور عابر پیاده و همراه',
    'عابر پیاده',
    'گذرگاه پیاده'
  ];
  Q3.QCorrectAnswer = 0;

  var Q4 = Question();
  Q4.QTitle =
      'کدامیک از پاسخ های زیر در خصوص نقص در سیستم جلوبندی و یا شکستگی آن صحیح می باشد؟';
  Q4.QImageName = 'driving';
  Q4.QAnswerList = [
    'تایر های عقب خودرو ساییده میشود',
    'مصرف سوخت افزایش میابد',
    'هدایت و کنترل خودرو از دست راننده خارج میشود',
    'رادیاتور خودرو جوش می آورد'
  ];
  Q4.QCorrectAnswer = 2;

  var Q5 = Question();
  Q5.QTitle = 'جمله(دیر رسیدن بهتر از هرگز نرسیدن است) چه مفهومی را می رساند؟';
  Q5.QImageName = 'driving';
  Q5.QAnswerList = [
    'دیر رسیدن بهتر از هرگز نرسیدن است',
    'با سرعت بالا حرکت کردن از صحنه حادثه',
    'عدم توجه به قوانین و مقررات',
    'پرهیز از عجله و شتاب در رانندگی'
  ];
  Q5.QCorrectAnswer = 3;

  return [Q1, Q2, Q3, Q4, Q5];
}

List<Question> getQList2() {
  var Q6 = Question();
  Q6.QTitle = 'کدامیک از موارد زیر در خصوص تبدیل نور بالا به پایین اشتباه است؟';
  Q6.QImageName = 'driving';
  Q6.QAnswerList = [
    'زمانی که فاصله خودرويي که از روبرو به شما نزدیک میشود 150 متر یا کمتر باشند نور بالا را به نور پايين تبديل کنيد',
    'زمانی که فاصله شما با خودرویی که در جلوی شما در حرکت است 150 متر يا کمتر است',
    'زماني که خودرويي از روبرو به شما نزدیک ميشود، نور بالا را به نور پايين تبديل کنيد',
    'زماني که خودرويي در پشت سر شما حرکت مي کند، نور بالا را به نور پايين تبديل کنيد'
  ];
  Q6.QCorrectAnswer = 3;

  var Q7 = Question();
  Q7.QTitle = 'نام این تابلو چیست؟';
  Q7.QImageName = '7';
  Q7.QAnswerList = [
    'عبور عابر پیاده',
    'عبور پیادگان',
    'عبور اطفال',
    'گذرگاه عابر پیاده'
  ];
  Q7.QCorrectAnswer = 2;

  var Q8 = Question();
  Q8.QTitle = 'حداکثر سرعت در میدان ها چند کیلومتر در ساعت است؟';
  Q8.QImageName = 'driving';
  Q8.QAnswerList = [
    '50 کیلومتر در ساعت',
    '30 کیلومتر در ساعت',
    '60 کیلومتر در ساعت',
    '70 کیلومتر در ساعت'
  ];
  Q8.QCorrectAnswer = 1;

  var Q9 = Question();
  Q9.QTitle = 'کدام گزینه در مورد ضد یخ صحیح می باشد؟';
  Q9.QImageName = 'driving';
  Q9.QAnswerList = [
    'عدم استفاده از ضد یخ در تابستان می تواند منجر به جوش آوردن زودتر موتور شود',
    'ضدیخ در جلوگیری از زنگ زدگی رادیاتور و قطعات سیستم خنک کاری موثر نیست',
    'بهتر است کل مخزن رادیاتور به جای آب از ضدیخ پر شود',
    'مایع ضد یخ از یخ زدگی آب در سرما جلوگیری نمیکند'
  ];
  Q9.QCorrectAnswer = 0;

  var Q10 = Question();
  Q10.QTitle =
      'تابلو های هشدار دهنده یا … بیشتر به صورت … با نوار حاشیه … رنگ و زمینه … رنگ می باشد.';
  Q10.QImageName = 'driving';
  Q10.QAnswerList = [
    'انتظامی - پنج ضلعی - قرمز – سفید',
    'اخطاری - مثلث - قرمز – سفید',
    'اخباری - دایره - قرمز – آبی',
    'اخطاری - مربع - قرمز - سفید'
  ];
  Q10.QCorrectAnswer = 1;

  return [Q6, Q7, Q8, Q9, Q10];
}

List<Question> getQList3() {
  var Q11 = Question();
  Q11.QTitle = 'کدامیک از موارد زیر در خصوص ایمن کردن صحنه حادثه می باشد؟';
  Q11.QImageName = 'driving';
  Q11.QAnswerList = [
    'مطمئن شدن از اینکه خطری شما را تهدید نمی کند - پارک خودرو در فاصله مناسب - استفاده از تابلوی اعلام خطر',
    'پارک خودرو در فاصله مناسب - کشیدن چند نفس عمیق و آرام',
    'استفاده از تابلو اعلام خطر - گرفتن شرح و حال از مصدومین - کشیدن چند نفس آرام و عمیق',
    'پارک خودرو در نزدیکی صحنه تصادف - بررسی وضعیت مصدومین - دور کردن مصدوم'
  ];
  Q11.QCorrectAnswer = 0;

  var Q12 = Question();
  Q12.QTitle = 'نام این تابلو چیست؟';
  Q12.QImageName = '12';
  Q12.QAnswerList = [
    'نام این تابلو چیست؟',
    'پیچ به راست',
    'پیچ به راست',
    'پیچ به چپ'
  ];
  Q12.QCorrectAnswer = 3;

  var Q13 = Question();
  Q13.QTitle =
      'در تقاطع رو به رو که فاقد چراغ راهنمایی است حق تقدم با کدام خودرو می ‌باشد؟';
  Q13.QImageName = '13';
  Q13.QAnswerList = [
    'خودرو شماره 1',
    'خودروی شماره ۲',
    'خودرویی که فاقد تابلوی رعایت حق تقدم است',
    'موارد 2 و 3'
  ];
  Q13.QCorrectAnswer = 3;

  var Q14 = Question();
  Q14.QTitle = 'کدامیک از موارد زیر در خصوص رانندگی در شب صحیح است؟';
  Q14.QImageName = 'driving';
  Q14.QAnswerList = [
    'میزان تصادفات در شب کاهش می یابد',
    'محدوده دید راننده در شب کاهش می‌یابد',
    'در شب زمان کمتر طول می‌ کشد تا راننده موانع موجود را ببیند',
    'با افزایش سرعت در شب ‌ها می توان کاهش دید را جبران کرد'
  ];
  Q14.QCorrectAnswer = 1;

  var Q15 = Question();
  Q15.QTitle =
      'کدام گزینه درباره عبور و توقف در مسیرهای ویژه اتوبوس شرکت واحد صحیح است؟';
  Q15.QImageName = 'driving';
  Q15.QAnswerList = [
    'در صورت نبودن پلیس می‌توان از خطوط ویژه استفاده نمود',
    'در ساعات شب می توان از مسیر ویژه اتوبوس عبور نمود',
    'به جز اتومبیل‌ های مجاز، برای مابقی وسایل نقلیه ممنوع است',
    'در صورت ترافیک سنگین می توان از مسیر ویژه اتوبوس عبور کرد'
  ];
  Q15.QCorrectAnswer = 1;

  return [Q11, Q12, Q13, Q14, Q15];
}
